КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул1_5_02/КонтурЛогистика_ПЛ_Титул1_5_02.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЛ_Титул1_5_02</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПЛ</name>
    <comment>(из пула!) Выдается ГИС ЭПД Уникальный идентификатор документа путевого листа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфСоб</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфСоб</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицоОформившееПЛ</name>
    <comment>Сведения о лице, оформившем путевой лист</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПЛ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязМедосмотрПосле</name>
    <comment>Признак обязательности проведения послесменного, послерейсового медицинского осмотра</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКоммерческойПеревозки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПЛ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПЛИнтервал</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель2</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <comment>Транспортное средство на котором начинает исполняться перевозки</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <comment>Обязателен если тип основного транспортного средства - тягач</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп2</name>
    <comment>Второй прицеп автопоезда</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>для себя, не отправим в документе</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияМедик</name>
    <comment>пусто >> равен ЛицоОформившееПЛ</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаQRКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <comment>признак отказа в подписи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <comment>текст содержащий причину отказа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыЕГАИС</name>
    <comment>Список идентификаторов ЕГАИС с разделителем ;</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделитель</name>
    <type>
      <types>DefinedType.КонтурЛогистика_РазделительДокументаУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведенияОПодписанте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьТ2Сразу</name>
    <comment>Если требуется создать и подписать сразу титул 2, то необходимо заполнить реквизиты с префиксом &quot;ДанныеТ2&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2МедРаботник</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2МедЛицензия</name>
    <comment>Лицензия на осущ. мед. деятельности</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2ДатВрПрМО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьТ3Сразу</name>
    <comment>Если требуется создать и подписать сразу титул 2, то необходимо заполнить реквизиты с префиксом &quot;ДанныеТ3&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ТехРаботник</name>
    <comment>Сведения о должностном лице, ответственном за техническое состояние и безопасную эксплуатацию транспортного средства</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ДатВрКонтТехСост</name>
    <comment>Дата и время контроля технического состояния</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ДатВрВыпНаЛин</name>
    <comment>Дата и время выпуска транспортного средства на линию</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ПоказанияОдометра</name>
    <comment>Показания одометра</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерМедик</name>
    <comment>надсущность над контрагентами, например, ТС Магнит или ТК Монополия</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеВодители</name>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СведенияГосСистем</name>
    <attributes>
      <name>НаимГосСист</name>
      <comment>Наименование государственной информационной системы</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчетЕд</name>
      <comment>Учетная единица в государственной информационной системе</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнаяИнф</name>
      <comment>Иная информация о товаре, подлежащем учету в государственной информационной системе</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдНомУчетЕд</name>
      <comment>Идентификационный номер учетной единицы в государственной информационной системе</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпецУслДвиж</name>
    <attributes>
      <name>СпецУсл</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпециальныеУсловияДвижения</types>
      </type>
    </attributes>
    <attributes>
      <name>НомСР</name>
      <comment>Номер специального разрешения, иного разрешительного документа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСР</name>
      <comment>Дата специального разрешения, иного разрешительного документа</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокСР</name>
      <comment>Срок действия специального разрешения, иного разрешительного документа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСР</name>
      <comment>Вид специального разрешения, иного разрешительного документа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаимОИВ</name>
      <comment>Краткое наименование органа исполнительной власти (специализированной уполномоченной организации), выдавшего документ</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдСР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СведМрш_МршТекст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СведМрш_МршМашЧит</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул1_5_02/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УИДПЛНеЗаполнен = Не ЗначениеЗаполнено(УИД_ПЛ);
	ПолучитьУИДИзПула = Ложь;
	ДополнительныеСвойства.Свойство("ПолучитьУИДИзПула", ПолучитьУИДИзПула);
	НуженУИДИзПула = ПолучитьУИДИзПула = Истина
		И РегистрыСведений.КонтурЛогистика_УИДыГИС.ЭтоПустойУИД(УИД_ПЛ);
	
	Если Не Отказ
		И (УИДПЛНеЗаполнен Или НуженУИДИзПула)
		И Не КонтурЛогистика_ОбработкаДокументовСервер.ЭтоВходящийДокумент(ДополнительныеСвойства)
		И ЗначениеЗаполнено(ЛицоОформившееПЛ) Тогда
		
		Если Не ЭтоПроверкаСквозногоСценария(ДополнительныеСвойства) Тогда
			
			Если НуженУИДИзПула Тогда
				
				Организация = КонтурЛогистика_ОбщегоНазначенияСервер.ОрганизацияДляЗапросаУИДов(ЭтотОбъект);
				КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СинхронизироватьОрганизациюИзСервисаЛогистика(Организация);
				
				Если Организация.ПродуктивЭпл Тогда
					
					ПолученныйУИД = РегистрыСведений.КонтурЛогистика_УИДыГИС.ПолучитьОчередной(Организация);
					Если ПолученныйУИД <> Неопределено Тогда
						УИД_ПЛ = ПолученныйУИД;
						ПроверитьИспользованиеУИДа(ПолученныйУИД, Отказ, Организация);
					Иначе
						Если Не ДополнительныеСвойства.Свойство("ТихийРежим") Тогда
							Сообщить("Не получен УИД из пула. Закончились?");
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					
					УИД_ПЛ = Строка(Новый УникальныйИдентификатор);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
						
	КонецЕсли;
	
	// Медик не наш, тогда не можем формировать Т2
	Если ФормироватьТ2Сразу
		И ЗначениеЗаполнено(ОрганизацияМедик)
		И ЛицоОформившееПЛ <> ОрганизацияМедик
		И Не ОрганизацияМедик.Наш Тогда
		
		ФормироватьТ2Сразу = Ложь;
	КонецЕсли;
	
	// Не можеи формировать Т3 без Т2
	Если ФормироватьТ3Сразу
		И Не ФормироватьТ2Сразу Тогда
		
		ФормироватьТ3Сразу = Ложь;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ПЛ_Титул1_5_02_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// а) Из документа учетной системы 
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
				
	// б) загружен из сервиса, создаем из файла обмена
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		// Идентификатор в Логистике
		kl_id = ДанныеЗаполнения.kl_id;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
		
	// в) копирование 
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Титул")
		И ДанныеЗаполнения.Свойство("Скопировать")
		И ДанныеЗаполнения.Скопировать Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Титул);
		Для каждого ТЧ Из ЭтотОбъект.Метаданные().ТабличныеЧасти Цикл
			Для каждого Стр Из ДанныеЗаполнения.Титул[ТЧ.Имя] Цикл
				НоваяСтрока = ЭтотОбъект[ТЧ.Имя].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			КонецЦикла;
		КонецЦикла;
		
		ЭтотОбъект.Номер = "";
		ЭтотОбъект.УИД_ПЛ = "";
		ЭтотОбъект.Дата = ТекущаяДатаСеанса();
		ЭтотОбъект.ДатаПЛ = ТекущаяДатаСеанса();
		ЭтотОбъект.kl_id = "";
		ЭтотОбъект.ХешСуммаQRКода = 0;
		КонтурЛогистика_ОбработкаДокументовСервер.ДобавитьНомерКопииКНомеруДокумента(
			ЭтотОбъект.НомерПЛ, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02);
		
	// в) ручной ввод Т1 с нуля
	Иначе
		
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02, "");
		
		ЗаполнитьДефолтыРучногоЗаполненияПоНастройкеКонвертации(КонтекстНастройкиКонвертации);
		
		ЗаполнитьРеквизитыПоПользователю();
		
	КонецЕсли;
	
	ЗаполнитьЗначенияПоУмолчанию();

	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ПЛ_Титул1_5_02_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	// Партнер-Медик
	Если Не ЗначениеЗаполнено(ПартнерМедик) И ЗначениеЗаполнено(ОрганизацияМедик) Тогда 
		
		КонтурЛогистика_КонвертацияСервер.ОпределитьПартнера(
			ЭтотОбъект,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02,
			"ОрганизацияМедик",
			ОрганизацияМедик);
			
	КонецЕсли;
	
	// ЛицоОформившееПЛ
	Если Не ЗначениеЗаполнено(ЛицоОформившееПЛ) Тогда
		ЛицоОформившееПЛ = Справочники.КонтурЛогистика_ОрганизацииДиадок.НашОформительПЛЕслиОдин();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидПеревозки)
		И ЗначениеЗаполнено(ВидСообщения)
		И ЗначениеЗаполнено(СрокПЛ) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛицоОформившееПЛ) Тогда
		РеквизитыПеревозчика = КонтурЛогистика_СтдОбщегоНазначения.ЗначенияРеквизитовОбъектаЛок(ЛицоОформившееПЛ,
			"ВидПеревозкиПоУмолчанию, ВидСообщенияПоУмолчанию, СрокДействияПоУмолчанию, ТехРаботникПоУмолчанию, МедЛицензияПоУмолчанию");
	Иначе
		РеквизитыПеревозчика = Неопределено;
	КонецЕсли;
	
	// ВидПеревозки
	Если Не ЗначениеЗаполнено(ВидПеревозки) Тогда
		
		// Глобальная
		ВидПеревозкиПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЛ_ВидПеревозкиПоУмолчанию");
		Если ЗначениеЗаполнено(ВидПеревозкиПоУмолчанию) Тогда
			ВидПеревозки = ВидПеревозкиПоУмолчанию;
		КонецЕсли;
		
		// Организация
		Если РеквизитыПеревозчика <> Неопределено
			И ЗначениеЗаполнено(РеквизитыПеревозчика.ВидПеревозкиПоУмолчанию) Тогда
			
			ВидПеревозки = РеквизитыПеревозчика.ВидПеревозкиПоУмолчанию;
		КонецЕсли;
		
	КонецЕсли;
	
	// ВидСообщения
	Если Не ЗначениеЗаполнено(ВидСообщения) Тогда
		
		// Глобальная
		ВидСообщенияПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЛ_ВидСообщенияПоУмолчанию");
		Если ЗначениеЗаполнено(ВидСообщенияПоУмолчанию) Тогда
			ВидСообщения = ВидСообщенияПоУмолчанию;
		КонецЕсли;
		
		// Организация
		Если РеквизитыПеревозчика <> Неопределено
			И ЗначениеЗаполнено(РеквизитыПеревозчика.ВидСообщенияПоУмолчанию) Тогда
			
			ВидСообщения = РеквизитыПеревозчика.ВидСообщенияПоУмолчанию;
		КонецЕсли;
		
	КонецЕсли;
	
	// СрокПЛ
	Если Не ЗначениеЗаполнено(СрокПЛ) Тогда
		
		СрокПЛЛок = 0;
		
		// Глобальная
		СрокДействияПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЛ_СрокДействияПоУмолчанию");
		Если ЗначениеЗаполнено(СрокДействияПоУмолчанию) Тогда
			СрокПЛЛок = СрокДействияПоУмолчанию;
		КонецЕсли;
		
		// Организация
		Если РеквизитыПеревозчика <> Неопределено
			И ЗначениеЗаполнено(РеквизитыПеревозчика.СрокДействияПоУмолчанию) Тогда
			
			СрокПЛЛок = РеквизитыПеревозчика.СрокДействияПоУмолчанию;
		КонецЕсли;
		
		СекундВДне = 60 * 60 * 24;
		СрокПЛ = НачалоДня(ТекущаяДатаСеанса()) + СекундВДне * СрокПЛЛок;
		
	КонецЕсли;
	
	// ДанныеТ3ТехРаботник
	Если Не ЗначениеЗаполнено(ДанныеТ3ТехРаботник) Тогда
		
		// Глобальная
		ТехРаботникПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЛ_ТехРаботникПоУмолчанию");
		Если ЗначениеЗаполнено(ТехРаботникПоУмолчанию) Тогда
			ДанныеТ3ТехРаботник = ТехРаботникПоУмолчанию;
		КонецЕсли;
		
		// Организация
		Если РеквизитыПеревозчика <> Неопределено
			И ЗначениеЗаполнено(РеквизитыПеревозчика.ТехРаботникПоУмолчанию) Тогда
			
			ДанныеТ3ТехРаботник = РеквизитыПеревозчика.ТехРаботникПоУмолчанию;
		КонецЕсли;
		
	КонецЕсли;
	
	// НомерПЛ
	Если Не ЗначениеЗаполнено(НомерПЛ) И Не ЗначениеЗаполнено(ДокументОснование) Тогда // Только для ввода вручную
		Если Не ЗначениеЗаполнено(Номер) Тогда
			УстановитьНовыйНомер();
		КонецЕсли;
		НомерПЛ = Номер;
	КонецЕсли;
	
	// ОрганизацияМедик
	Если ЗначениеЗаполнено(ЛицоОформившееПЛ)
		И Не КонтурЛогистика_СтдОбщегоНазначения.ЗначениеРеквизитаОбъектаЛок(ЛицоОформившееПЛ, "Медик")
		И Не ЗначениеЗаполнено(ОрганизацияМедик) Тогда
		
		ОрганизацияМедикПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЛ_ОрганизацияМедикПоУмолчанию");
		Если ЗначениеЗаполнено(ОрганизацияМедикПоУмолчанию) Тогда
			ОрганизацияМедик = ОрганизацияМедикПоУмолчанию;
		КонецЕсли;
		
	КонецЕсли;
	
	// ДанныеТ2МедЛицензия
	Если Не ЗначениеЗаполнено(ДанныеТ2МедЛицензия)
		И РеквизитыПеревозчика <> Неопределено
		И ЗначениеЗаполнено(РеквизитыПеревозчика.МедЛицензияПоУмолчанию) Тогда
		
		ДанныеТ2МедЛицензия = РеквизитыПеревозчика.МедЛицензияПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДата();
	УИД_ПЛ = "";
	ХешСуммаQRКода = 0;
	ЕстьОтказВПодписи = Ложь;
	ПричинаОтказаВПодписи = "";
	kl_id = "";
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьИзДокументаОснования

Процедура ЗаполнитьПоДокОснованию(Знач ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Свойство("ПредыдущийТитул") Тогда
		ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	Иначе
		ПредыдущийТитул = Неопределено;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("СпецСценарий") Тогда
		СпецСценарий = ДанныеЗаполнения.СпецСценарий;
	Иначе
		СпецСценарий = Неопределено;
	КонецЕсли;
	
	Разделитель = Неопределено;
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	
	ДанныеЗаполнения.Свойство("Разделитель", Разделитель);
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		ДанныеЗаполнения.ТипЛогистика, ДокументОснование, СпецСценарий);
	
	КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
		ЭтотОбъект, КонтекстНастройкиКонвертации);
	
	// Могли быть переданы конкретные N документов оснований а не 1
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяМногиеКОдномуЭПЛ") Тогда 
		Если ДанныеЗаполнения.Свойство("ДокументыОснования") 
			И ТипЗнч(ДанныеЗаполнения.ДокументыОснования) = Тип("Массив") Тогда
			Для Каждого ДопДокОснование Из ДанныеЗаполнения.ДокументыОснования Цикл 
				НовСтр = ДокументыОснования.Добавить();
				НовСтр.ДокументОснование = ДопДокОснование;
			КонецЦикла;
		Иначе
			НовСтр = ДокументыОснования.Добавить();
			НовСтр.ДокументОснование = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;
	Иначе
		НовСтр = ДокументыОснования.Добавить();
		НовСтр.ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	КонецЕсли;
	ДокументыОснования.Свернуть("ДокументОснование");
	
	Если ЗначениеЗаполнено(КонтекстНастройкиКонвертации.ПоискОснованийКодНа1С)
		И КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуютсяМногиеКОдномуЭПЛ") Тогда 
		
		//вычислить массив оснований
		Попытка
			МассивДокументыОснования = Новый Массив;
			Выполнить(КонтекстНастройкиКонвертации.ПоискОснованийКодНа1С);
			Для Каждого ДопДокОснование Из МассивДокументыОснования Цикл 
				НовСтр = ДокументыОснования.Добавить();
				НовСтр.ДокументОснование = ДопДокОснование;
			КонецЦикла;
			
			ДокументыОснования.Свернуть("ДокументОснование");
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ИдентификаторыЕГАИС) Тогда
		ПоложитьИдентификаторыЕГАИСВИнфПоля(ИдентификаторыЕГАИС);
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ОбновитьСтатусГотовностиЭПДУчастниковПеревозки(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПоложитьИдентификаторыЕГАИСВИнфПоля(ИдентификаторыЕГАИС)
	
	МассивИдентификаторыЕГАИС = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(ИдентификаторыЕГАИС, ";", Ложь);
			
	Для каждого Идентификатор Из МассивИдентификаторыЕГАИС Цикл
		
		НоваяСтрока = ИнфПол.Добавить();
		НоваяСтрока.Идентиф = "ЕГАИС";
		НоваяСтрока.Значение = СокрЛП(Идентификатор);
					
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьИзФайлаОбмена

Процедура ЗаполнитьДефолтыРучногоЗаполненияПоНастройкеКонвертации(КонтекстНастройкиКонвертации)
	
	Разделитель = Неопределено;
	ДокументОснование = Неопределено;
	
	ДополнительныеВодители.Очистить();
	ДополнительныеПолучателиФайла.Очистить();
	ИнфПол.Очистить();
	ДокументыОснования.Очистить();
	
	КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
		ЭтотОбъект, КонтекстНастройкиКонвертации);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьИзФайлаОбмена

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	XDTO = КС.ПолучитьXDTOпоXML(ТекстФайла);
	
	СодИнфСоб 	= XDTO.Документ.СодИнфСоб;
	
	ИдентификаторыУчастниковЭДО = КС.ИдентификаторыСторонИзИмениФайлаТитула(
		ФайлСсылка.ИмяФайла, КС.XDTO_ПолучитьЗначениеСвойства(XDTO, "ИдФайл"));
	
	ЗаполнитьРеквизитыТитулаИзXDTO(XDTO, СодИнфСоб, ИдентификаторыУчастниковЭДО);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO, Знач СодИнфСоб, ИдентификаторыУчастниковЭДО)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	УИД_ПЛ 	= КС.XDTO_Вычислить(СодИнфСоб, "УИД_ПЛ");
	
	ДатИнфСоб 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO, "Документ.ДатИнфСоб"));
	ВрИнфСоб 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(XDTO, "Документ.ВрИнфСоб"));

	ЛицоОформившееПЛ    = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
		КС.XDTO_ПолучитьЗначениеСвойства(СодИнфСоб, "СвЛицПЛ"), ИдентификаторыУчастниковЭДО.Оформитель, Истина);
	
	МассивКлючей_R_Т_A_О_W = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(КС.XDTO_Вычислить(XDTO,"ИдФайл"), "_");
	КлючA = МассивКлючей_R_Т_A_О_W[2];
		
	// мед раб
	ОргA = Справочники.КонтурЛогистика_ОрганизацииДиадок.НайтиСоздатьПоИдентификаторуЭДО(КлючA);
	Если ОргA <> ЛицоОформившееПЛ Тогда 
		ОрганизацияМедик = ОргA;
	КонецЕсли;
	
	НомерПЛ  	= КС.XDTO_Вычислить(XDTO, "Документ.НомДок");
	ДатаПЛ_raw	= КС.XDTO_Вычислить(XDTO, "Документ.ДатаДок");
	ДатаПЛ		= КС.Конвертировать_ДатаТип_вДата(ДатаПЛ_raw);
	
	ОбязМедосмотрПосле			= КС.XDTO_Вычислить(СодИнфСоб, "ОбМедОсмПосле") = "1";
	ВидПеревозки				= Перечисления.КонтурЛогистика_ВидыПеревозки.ЗначениеИзXDTO(КС.XDTO_Вычислить(СодИнфСоб, "ВидПрв"));	
	ВидКоммерческойПеревозки 	= Перечисления.КонтурЛогистика_ВидыКоммерческихПеревозок.ЗначениеИзXDTO(КС.XDTO_Вычислить(СодИнфСоб, "ВидКП"));
	ВидСообщения				= Перечисления.КонтурЛогистика_ВидыПутейСообщений.ЗначениеИзXDTO(КС.XDTO_Вычислить(СодИнфСоб, "ВидСообщ"));
		
	Если КС.XDTO_Вычислить(СодИнфСоб, "СрокПЛ.ПЛДень") = "1" Тогда 
		СрокПЛ = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(СодИнфСоб, "СрокПЛ.ДатаИспПЛ"));
		СрокПЛИнтервал = СрокПЛ;
	Иначе
		СрокПЛ = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(СодИнфСоб, "СрокПЛ.ДатаНачИспПЛ"));
		СрокПЛИнтервал = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(СодИнфСоб, "СрокПЛ.ДатаКонИспПЛ"));
	КонецЕсли;
	
	СвТС_XDTO 				= КС.XDTO_Вычислить(СодИнфСоб, "СвТС");
	ТранспортноеСредство 	=  КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(КС.XDTO_Вычислить(СвТС_XDTO, "ТС"), Ложь);
	Прицепы_XDTO 			=  КС.XDTO_Вычислить(СвТС_XDTO, "Прицеп");
	МассивПрицеповXDTO		= КС.XDTO_ВычислитьМассивXDTO(Прицепы_XDTO);
	КолчествоПрицепов = МассивПрицеповXDTO.Количество();
	Если КолчествоПрицепов > 0 Тогда
		Прицеп 				= КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(МассивПрицеповXDTO[0], Истина);
		
		Если КолчествоПрицепов > 1 Тогда
			Прицеп2			= КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(МассивПрицеповXDTO[1], Истина);
		КонецЕсли;
	КонецЕсли;
	
	// Водитель 1
	СвВодит_XDTO		= КС.XDTO_Вычислить(СодИнфСоб, "СвВодит");
	МассивСвВодит_XDTO  = КС.XDTO_ВычислитьМассивXDTO(СвВодит_XDTO);
	Водитель 	= КС.Конвертировать_СвВодит_вВодителяЛогистика(МассивСвВодит_XDTO[0]);
	// Водитель 2
	Если МассивСвВодит_XDTO.Количество() > 1 Тогда 
		Водитель2 	= КС.Конвертировать_СвВодит_вВодителяЛогистика(МассивСвВодит_XDTO[1]);
	КонецЕсли;
	// Водитель 3,4...
	Если МассивСвВодит_XDTO.Количество() > 2 Тогда 
		
		Для й = 2 По МассивСвВодит_XDTO.Количество() Цикл
			НоваяСтрокаДопВодителя = ДополнительныеВодители.Добавить();
			НоваяСтрокаДопВодителя.Водитель = КС.Конвертировать_СвВодит_вВодителяЛогистика(МассивСвВодит_XDTO[й-1]);
		КонецЦикла;
		
	КонецЕсли;
	
	// спец условия движения
	КС.ЗаполнитьСпецУслДвижИзXDTO(СодИнфСоб, ЭтотОбъект, "СпецУслДвиж");
	
	// учет в гос системах
	КС.ЗаполнитьСвГосСистИзXDTO(СодИнфСоб, ЭтотОбъект, "СведенияГосСистем");
		
	ТипПодпис_raw = КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.ТипПодпис");
	ТипПодпис = Перечисления.КонтурЛогистика_ТипыПодписи.ЗначениеИзXDTO(ТипПодпис_raw);
	
	СпосПодтПолном_raw = КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.СпосПодтПолном");
	СпосПодтПолном = Перечисления.КонтурЛогистика_СпособыПодтвержденияПолномочий.ЗначениеИзXDTO(СпосПодтПолном_raw);
	
	Должность 	= КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.Должн");
	
	Фамилия 	= КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.ФИО.Фамилия");
	Имя 		= КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.ФИО.Имя");
	Отчество 	= КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.ФИО.Отчество");
	
	ДопСведенияОПодписанте = КС.XDTO_Вычислить(XDTO, "Документ.ПодпИнфСоб.ДопСведПодп");
	
	// ИнфПол
	КС.ЗаполнитьИнфПолИзXDTOсИдФайл(СодИнфСоб, ЭтотОбъект, "ИнфПол");
	
	КС.ЗаполнитьДополнительныхПолучателей(XDTO, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ГенерацияXML

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	Если ПараметрыФайлаРеквизиты <> Неопределено
		И (Не ПараметрыФайлаРеквизиты.Свойство("ТребуетсяПодпись") 
			Или (ПараметрыФайлаРеквизиты.Свойство("ТребуетсяПодпись") И Не ПараметрыФайлаРеквизиты.ТребуетсяПодпись)) Тогда
		// Выполнить валидацию документа
		РезультатВалидации = Документы.КонтурЛогистика_ПЛ_Титул1_5_02.ПроверитьДокумент(Ссылка);
		
		Если РезультатВалидации.КоличествоОшибок > 0 Тогда
			
			Разблокировать();
			Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
			Результат.Успешно = Ложь;
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли;

	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ДатИнфСоб = ТекущаяДатаСеанса();
	ВрИнфСоб = ТекущаяДатаСеанса();
	
	Попытка
		
		// формируем текст xml
		КрайнийФайл = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ЭтотОбъект.Ссылка);
		ТекущееСостояние = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(ЭтотОбъект.Ссылка);
		
		Если ЗначениеЗаполнено(КрайнийФайл)
			И ЗначениеЗаполнено(ТекущееСостояние)
			И ТекущееСостояние.Код = "pl-wait-opened-sign" Тогда 
			
			ТекстФайла = КрайнийФайл.ТекстXML.Получить();
			
			НовыйGUID = Строка(Новый УникальныйИдентификатор);
			ТекстФайлаXML = СтрЗаменить(ТекстФайла, КрайнийФайл.GUID, НовыйGUID);
			ИмяФайла = СтрЗаменить(КрайнийФайл.ИмяФайла, КрайнийФайл.GUID, НовыйGUID);
			ТекстФайлаXML = СтрЗаменить(ТекстФайлаXML, РегистрыСведений.КонтурЛогистика_УИДыГИС.ПустойУИД(), УИД_ПЛ);
			Если Найти(ТекстФайлаXML, "УИД_ПЛ") = 0 Тогда
				ТекстФайлаXML = СтрЗаменить(ТекстФайлаXML, "<СодИнфСоб", "<СодИнфСоб УИД_ПЛ=" + """" + УИД_ПЛ + """" + " ");	
			КонецЕсли;
			
			РезультатФормированияТекста = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
			РезультатФормированияТекста.Вставить("ТекстФайла", ТекстФайлаXML);
			РезультатФормированияТекста.Вставить("ИдФайл", ИмяФайла);
			РезультатФормированияТекста.Вставить("GUID", НовыйGUID);
			РезультатФормированияТекста.Успешно = Истина;
			
		Иначе
			
			РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфСоб, ВрИнфСоб);
			
		КонецЕсли;
			
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфСоб и ВрИнфСоб
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить(ТекстОшибки);
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	НомерТитула = 1;
	Формат = "5.02";
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула, Формат, "__PL");
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	ОтправительФайла = ЛицоОформившееПЛ;
	
	Если ДополнительныеПолучателиФайла.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайла); 	
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаПЛ_5_02(НомерТитула, 
												ОтправительФайла,
												ОрганизацияМедик,																								
												GUID,
												W);
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
												
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ОтправительФайла, ПользовательПодписант, ДатаПЛ, ЭтотОбъект, ПараметрНастроекПодписания);
		
	XDTO_Подписант 		= КС.XDTO_ПодпИнф(НомерТитула, "__PL", Формат, ПодписантСтруктура);
	Если ЗначениеЗаполнено(ПодписантСтруктура.МЧД) И ПодписантСтруктура.СпосПодтПолном = "3" Тогда 
		Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	КонецЕсли;
		
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, "__PL", Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);

	XDTO_СодИнфСоб = КС.XDTO_ПЛ_СодИнфСоб_5_02(НомерТитула, Формат, Ссылка);
	
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфСоб", XDTO_СодИнфСоб);
		
	КС.XDTO_Установить(XDTO_Файл.Документ, "ДатаДок", КС.XDTO_ДатаТип(ДатаПЛ));
	КС.XDTO_Установить(XDTO_Файл.Документ, "НомДок", СокрЛП(НомерПЛ));
			
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ОрганизацияПодписанта = ЛицоОформившееПЛ;
			
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ОрганизацияПодписанта,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
				
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура ПроверитьИспользованиеУИДа(ПолученныйУИД, Отказ, Организация)
	
	УспешноОтметилиИспользованиеУИД = РегистрыСведений.КонтурЛогистика_УИДыГИС.ОтметитьИспользованным(УИД_ПЛ, Организация);
	Если Не УспешноОтметилиИспользованиеУИД Тогда
		
		Отказ = Истина;
		Сообщить("УИД из пула был использован другим документом, попробуйте повторить операцию");
		
	КонецЕсли;
	
КонецПроцедуры		

Функция ЭтоПроверкаСквозногоСценария(ДопСведения)
	
	Если ТипЗнч(ДопСведения) = Тип("Структура") 
		И ДопСведения.Свойство("ПроверкаСквозногоСценария") Тогда		
		Возврат Истина;
	Иначе
		Возврат Ложь
	КонецЕсли;
			
КонецФункции

#КонецОбласти

#КонецЕсли
